In [1]:
import pandas as pd
import numpy as np

## Creating DataFrames

In [3]:
df = pd.DataFrame(
    {"a" : [4, 5, 6],
    "b" : [7, 8, 9],
    "c" : [10, 11, 12]},
    index = [1, 2, 3])

In [4]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [5]:
df['a']

1    4
2    5
3    6
Name: a, dtype: int64

In [6]:
df['b']

1    7
2    8
3    9
Name: b, dtype: int64

In [7]:
df.loc[3, 'a']

6

In [8]:
df.loc[[1,2],['a', 'b']]

   a  b
1  4  7
2  5  8

In [11]:
# dictionary를 이용해 DataFrame을 생성하고, index명을 지정
df = pd.DataFrame(
    {"a" : [4, 5, 6],
    "b" : [7, 8, 9],
    "c" : [10, 11, 12]},
    index = [1, 2, 3])
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [12]:
# index와 column명을 각각 지정하는 방법
df = pd.DataFrame(
    [[4, 7, 10],
    [5, 8, 11],
    [6, 9, 12]],
    index=[1, 2, 3],
    columns=['a', 'b', 'c'])
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [14]:
# Multi-index를 부여하는 방법
df = pd.DataFrame(
    {"a" : [4 ,5, 6],
    "b" : [7, 8, 9],
    "c" : [10, 11, 12]},
    index = pd.MultiIndex.from_tuples(
            [('d', 1), ('d', 2),('e', 2)], names=['n', 'v']))
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

## Subset Observations (Rows)

In [15]:
df[df.a < 7]

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [17]:
df[df.b > 7]

     a  b   c
n v
d 2  5  8  11
e 2  6  9  12

In [18]:
df[df['c'] > 7]

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [19]:
df[df['c'] < 7]

Empty DataFrame
Columns: [a, b, c]
Index: []

In [23]:
# 중복 값 제거
df = pd.DataFrame(
    {"a" : [4 ,5, 6, 6],
    "b" : [7, 8, 9, 9],
    "c" : [10, 11, 12, 12]},
    index = pd.MultiIndex.from_tuples(
            [('d', 1), ('d', 2),('e', 2),('e', 3)], names=['n', 'v']))
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12
  3  6  9  12

In [27]:
df.drop_duplicates()

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [29]:
df = df.drop_duplicates(keep='last')  # 중복 된 열 값 중 마지막 것을 살림.
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 3  6  9  12

## 연산자

In [30]:
df['b'] != 7

n  v
d  1    False
   2     True
e  3     True
Name: b, dtype: bool

In [31]:
df[df['b'] != 7]

     a  b   c
n v
d 2  5  8  11
e 3  6  9  12

In [33]:
df.a.isin([5])   # list형태의 자료형이 input값으로 들어가야 함.

n  v
d  1    False
   2     True
e  3    False
Name: a, dtype: bool

In [34]:
df['a'].isin([5])

n  v
d  1    False
   2     True
e  3    False
Name: a, dtype: bool

In [35]:
df[df['a'].isin([5])]

     a  b   c
n v
d 2  5  8  11

In [38]:
# null값 제거
df = pd.DataFrame(
    {"a" : [4 ,5, 6, 6, np.nan],
    "b" : [7, 8,np.nan, 9, 9],
    "c" : [10, 11, 12,np.nan, 12]},
    index = pd.MultiIndex.from_tuples(
            [('d', 1), ('d', 2),('e', 2),('e', 3),('e', 3)], names=['n', 'v']))
df

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  3  NaN  9.0  12.0

In [39]:
df.isnull()

         a      b      c
n v
d 1  False  False  False
  2  False  False  False
e 2  False   True  False
  3  False  False   True
  3   True  False  False

In [41]:
df['a'].isnull().sum() # null값의 갯수

1

In [44]:
df['a'].notnull().sum() # null값이 아닌 것의 갯수

4

In [45]:
df.any()

a    True
b    True
c    True
dtype: bool

In [46]:
~df.any()

a    False
b    False
c    False
dtype: bool

In [47]:
df.all()

a    True
b    True
c    True
dtype: bool

In [54]:
df[df['b']==7]

       a    b     c
n v
d 1  4.0  7.0  10.0

In [56]:
df[df['a']==5]

       a    b     c
n v
d 2  5.0  8.0  11.0

## Summarize Data

In [65]:
import seaborn as sns

In [66]:
df = sns.load_dataset('iris')
df.shape

(150, 5)

In [68]:
df.head(2)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa

In [70]:
pd.DataFrame(df['species'].value_counts())

            species
setosa           50
versicolor       50
virginica        50

In [71]:
len(df)

150

In [72]:
df.shape[0]

150

In [74]:
df['species'].nunique()  # 변수 값의 종류의 수

3

In [75]:
df.describe()   # 수치형 자료들의 결과를 보여줌

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [76]:
df.describe(include = 'all')   # object 자료들의 결과도 보여줌

        sepal_length  sepal_width  petal_length  petal_width species
count     150.000000   150.000000    150.000000   150.000000     150
unique           NaN          NaN           NaN          NaN       3
top              NaN          NaN           NaN          NaN  setosa
freq             NaN          NaN           NaN          NaN      50
mean        5.843333     3.057333      3.758000     1.199333     NaN
std         0.828066     0.435866      1.765298     0.762238     NaN
min         4.300000     2.000000      1.000000     0.100000     NaN
25%         5.100000     2.800000      1.600000     0.300000     NaN
50%         5.800000     3.000000      4.350000     1.300000     NaN
75%         6.400000     3.300000      5.100000     1.800000     NaN
max         7.900000     4.400000      6.900000     2.500000     NaN

In [77]:
df.describe(include=[np.object])   # object 자료들의 결과만 보여줌

/var/folders/tp/bw8ghd4j7xg_tty_47p898mh0000gn/T/ipykernel_9359/127470446.py:1: DeprecationWarning: `np.object` is a deprecated alias for the builtin `object`. To silence this warning, use `object` by itself. Doing this will not modify any behavior and is safe.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  df.describe(include=[np.object])

       species
count      150
unique       3
top     setosa
freq        50

In [78]:
df.describe(include=[np.number])   # 수치형 자료들의 결과만 보여줌

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [79]:
df['petal_width'].sum()

179.90000000000003

In [80]:
df['petal_width'].count()

150

In [81]:
df['petal_width'].mean()

1.199333333333334

In [82]:
df['petal_width'].median()

1.3

In [84]:
df['petal_width'].quantile([0.25,0.75])

0.25    0.3
0.75    1.8
Name: petal_width, dtype: float64

In [85]:
df.min()

sepal_length       4.3
sepal_width        2.0
petal_length       1.0
petal_width        0.1
species         setosa
dtype: object

In [86]:
df.max()

sepal_length          7.9
sepal_width           4.4
petal_length          6.9
petal_width           2.5
species         virginica
dtype: object

In [87]:
df.var()

/var/folders/tp/bw8ghd4j7xg_tty_47p898mh0000gn/T/ipykernel_9359/1568254755.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.var()

sepal_length    0.685694
sepal_width     0.189979
petal_length    3.116278
petal_width     0.581006
dtype: float64

In [88]:
df.std()

/var/folders/tp/bw8ghd4j7xg_tty_47p898mh0000gn/T/ipykernel_9359/3390915376.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.std()

sepal_length    0.828066
sepal_width     0.435866
petal_length    1.765298
petal_width     0.762238
dtype: float64

### df.apply(function)

In [89]:
df.apply(lambda x: x[0])

sepal_length       5.1
sepal_width        3.5
petal_length       1.4
petal_width        0.2
species         setosa
dtype: object

In [90]:
df['species'].apply(lambda x: x[0])

0      s
1      s
2      s
3      s
4      s
      ..
145    v
146    v
147    v
148    v
149    v
Name: species, Length: 150, dtype: object

In [92]:
df['species_3']=df['species'].apply(lambda x: x[:3])
df['species_3']

0      set
1      set
2      set
3      set
4      set
      ...
145    vir
146    vir
147    vir
148    vir
149    vir
Name: species_3, Length: 150, dtype: object

In [93]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width species species_3
0           5.1          3.5           1.4          0.2  setosa       set
1           4.9          3.0           1.4          0.2  setosa       set
2           4.7          3.2           1.3          0.2  setosa       set
3           4.6          3.1           1.5          0.2  setosa       set
4           5.0          3.6           1.4          0.2  setosa       set

## Make New columns

In [98]:
df = pd.DataFrame({'A': range(1,11), 'B': np.random.randn(10)})
df

    A         B
0   1 -0.353206
1   2 -1.040599
2   3  0.507763
3   4  0.429574
4   5 -0.704580
5   6  1.619623
6   7 -0.152779
7   8  1.270993
8   9  1.257394
9  10 -0.978924

In [99]:
df.assign?

In [102]:
df.assign(ln_A=lambda x: np.log(x.A)).head()   # np.log(A)값을 계산해서 새로운 컬럼 ln_A에 추가하는 내용

   A         B      ln_A
0  1 -0.353206  0.000000
1  2 -1.040599  0.693147
2  3  0.507763  1.098612
3  4  0.429574  1.386294
4  5 -0.704580  1.609438

In [103]:
df['ln_A'] = np.log(df.A)  # 위 코드와 같은 코드
# df.ln_A = np.log(df.A) 도 동일한 코드
df

    A         B      ln_A
0   1 -0.353206  0.000000
1   2 -1.040599  0.693147
2   3  0.507763  1.098612
3   4  0.429574  1.386294
4   5 -0.704580  1.609438
5   6  1.619623  1.791759
6   7 -0.152779  1.945910
7   8  1.270993  2.079442
8   9  1.257394  2.197225
9  10 -0.978924  2.302585

In [104]:
pd.qcut?

In [105]:
# range(5)까지의 수를 3가지의 구간으로 나누고, good, medium, bad를 부여 (숫자형 데이터를 카테고리 데이터로 변환)
pd.qcut(range(5), 3, labels=["good", "medium", "bad"])

['good', 'good', 'medium', 'bad', 'bad']
Categories (3, object): ['good' < 'medium' < 'bad']

In [106]:
# df A컬럼의 수를 3가지의 구간으로 나누고, good, medium, bad를 부여
pd.qcut(df.A, 3, labels=["good", "medium", "bad"])

0      good
1      good
2      good
3      good
4    medium
5    medium
6    medium
7       bad
8       bad
9       bad
Name: A, dtype: category
Categories (3, object): ['good' < 'medium' < 'bad']

In [107]:
# df B컬럼의 수를 3가지의 구간으로 나누고, good, medium, bad를 부여
pd.qcut(df.B, 3, labels=["good", "medium", "bad"])

0      good
1      good
2    medium
3    medium
4      good
5       bad
6    medium
7       bad
8       bad
9      good
Name: B, dtype: category
Categories (3, object): ['good' < 'medium' < 'bad']

In [108]:
# df B컬럼의 수를 2가지의 구간으로 나누고, good, medium, bad를 부여
pd.qcut(df.B, 2, labels=["good", "bad"])

0    good
1    good
2     bad
3     bad
4    good
5     bad
6    good
7     bad
8     bad
9    good
Name: B, dtype: category
Categories (2, object): ['good' < 'bad']

In [111]:
df.max(axis=1) # row 방향으로 비교

0     1.0
1     2.0
2     3.0
3     4.0
4     5.0
5     6.0
6     7.0
7     8.0
8     9.0
9    10.0
dtype: float64

In [110]:
df.max(axis=0) # column 방향으로 비교

A       10.000000
B        1.619623
ln_A     2.302585
dtype: float64

In [112]:
df.min(axis=1)

0   -0.353206
1   -1.040599
2    0.507763
3    0.429574
4   -0.704580
5    1.619623
6   -0.152779
7    1.270993
8    1.257394
9   -0.978924
dtype: float64

In [116]:
df['A'].clip(lower=-1,upper=5)  # 최소값 최대값 제한하기

0    1
1    2
2    3
3    4
4    5
5    5
6    5
7    5
8    5
9    5
Name: A, dtype: int64

In [118]:
df['B'].clip(lower=1,upper=10)   # 최소값 최대값 제한하기

0    1.000000
1    1.000000
2    1.000000
3    1.000000
4    1.000000
5    1.619623
6    1.000000
7    1.270993
8    1.257394
9    1.000000
Name: B, dtype: float64

## Reshaping Data

### Melt

In [121]:
df = pd.DataFrame({'A': {0: 'a', 1: 'b', 2: 'c'},
                   'B': {0: 1, 1: 3, 2: 5},
                   'C': {0: 2, 1: 4, 2: 6}})
df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

In [122]:
pd.melt(df, id_vars=['A'], value_vars=['B'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5

In [123]:
pd.melt(df, id_vars=['A'], value_vars=['B', 'C'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5
3  a        C      2
4  b        C      4
5  c        C      6

In [125]:
pd.melt(df, value_vars=['A', 'B', 'C']).rename(columns = {'variable': 'var', 'value': 'val'})

  var val
0   A   a
1   A   b
2   A   c
3   B   1
4   B   3
5   B   5
6   C   2
7   C   4
8   C   6

### pivot

In [128]:
df2 = pd.DataFrame({'foo': ['one', 'one', 'one', 'two', 'two',
                            'two'],
                    'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
                    'baz': [1, 2, 3, 4, 5, 6],
                    'zoo': ['x', 'y', 'z', 'q', 'w', 't']})
df2

   foo bar  baz zoo
0  one   A    1   x
1  one   B    2   y
2  one   C    3   z
3  two   A    4   q
4  two   B    5   w
5  two   C    6   t

In [129]:
df2.pivot(index = 'foo', columns='bar', values='baz')

bar  A  B  C
foo
one  1  2  3
two  4  5  6

In [131]:
df3 = df2.pivot(index = 'foo', columns='bar', values='baz').reset_index()
df3

bar  foo  A  B  C
0    one  1  2  3
1    two  4  5  6

In [136]:
df3.melt(id_vars=['foo'], value_vars=['A', 'B', 'C']).sort_values(['foo', 'bar'])

   foo bar  value
0  one   A      1
2  one   B      2
4  one   C      3
1  two   A      4
3  two   B      5
5  two   C      6

In [137]:
df3.melt(
    id_vars=['foo'], 
    value_vars=['A', 'B', 'C']).sort_values(['foo', 'bar']).rename(columns = {'value': 'baz'})

   foo bar  baz
0  one   A    1
2  one   B    2
4  one   C    3
1  two   A    4
3  two   B    5
5  two   C    6

## Concat

In [139]:
s1 = pd.Series(['a', 'b'])
s1

0    a
1    b
dtype: object

In [140]:
s2 = pd.Series(['c', 'd'])
s2

0    c
1    d
dtype: object

In [141]:
pd.concat([s1, s2])

0    a
1    b
0    c
1    d
dtype: object

In [142]:
pd.concat([s1,s2], ignore_index = True)

0    a
1    b
2    c
3    d
dtype: object

In [143]:
pd.concat([s1, s2], keys=['s1', 's2'])    # key 생성

s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

In [144]:
pd.concat([s1, s2], keys=['s1', 's2'],
          names=['Series name', 'Row ID'])   # key의 이름을 부여

Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

In [145]:
df1 = pd.DataFrame([['a', 1], ['b', 2]],
                   columns=['letter', 'number'])
df1

  letter  number
0      a       1
1      b       2

In [146]:
df2 = pd.DataFrame([['c', 3], ['d', 4]],
                   columns=['letter', 'number'])
df2

  letter  number
0      c       3
1      d       4

In [147]:
pd.concat([df1, df2])

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [148]:
df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
                   columns=['letter', 'number', 'animal'])
df3

  letter  number animal
0      c       3    cat
1      d       4    dog

In [149]:
df1

  letter  number
0      a       1
1      b       2

In [151]:
pd.concat([df1, df3])

  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

In [152]:
pd.concat([df1, df3], join = 'inner')  # 공통되는 부분만 합침

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [159]:
df1

  letter  number
0      a       1
1      b       2

In [154]:
df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
                   columns=['animal', 'name'])
df4

   animal    name
0    bird   polly
1  monkey  george

In [158]:
pd.concat([df1, df4])

  letter  number  animal    name
0      a     1.0     NaN     NaN
1      b     2.0     NaN     NaN
0    NaN     NaN    bird   polly
1    NaN     NaN  monkey  george

In [162]:
pd.concat([df1, df4], axis = 1)    # 열 방향으로 df를 합침

  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

In [155]:
df5 = pd.DataFrame([1], index=['a'])
df5

   0
a  1

In [156]:
df6 = pd.DataFrame([2], index=['a'])
df6

   0
a  2

In [163]:
pd.concat([df5, df6])

   0
a  1
a  2

In [165]:
pd.concat([df5, df6], verify_integrity=True)   # 중복되는 값이 있는지 확인하는 옵션임. df5와 df6의 인덱스에 중복되는 값이 있어 에러 발생함.

ValueError: Indexes have overlapping values: Index(['a'], dtype='object')